Revit 2027 API
LinkedResourceOpenedEventArgs.ResourceTypeId Property
 Element id of the linked resource.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ResourceTypeId { get; }
Public ReadOnly Property ResourceTypeId As ElementId
	Get
public:
property ElementId^ ResourceTypeId {
	ElementId^ get ();
}
member ResourceTypeId : ElementId with get
Property Value
ElementId
See Also
Reference
LinkedResourceOpenedEventArgs Class
Autodesk.Revit.DB.Events Namespace